import csv
import os


# Данные из таблицы
data = [
    {
        "ID": 101,
        "Название детали": "Моторчик омывателя лобового стекла",
        "Совместимость моделей": "XDrive G6 (2008–2013), Vento L3 (2007–2012)",
        "Оригинал": "Да",
        "Цена (₽)": 2100,
        "Артикул": "MTR-101-O"
    },
    {
        "ID": 102,
        "Название детали": "Моторчик омывателя (аналог)",
        "Совместимость моделей": "XDrive G6, Vento L3",
        "Оригинал": "Нет",
        "Цена (₽)": 1350,
        "Артикул": "MTR-101-A"
    },
    {
        "ID": 201,
        "Название детали": "Задний фонарь правый",
        "Совместимость моделей": "Cruiser B7 (2010–2015)",
        "Оригинал": "Да",
        "Цена (₽)": 5900,
        "Артикул": "LGT-201-O"
    },
    {
        "ID": 202,
        "Название детали": "Задний фонарь (аналог Depo)",
        "Совместимость моделей": "Cruiser B7",
        "Оригинал": "Нет",
        "Цена (₽)": 3600,
        "Артикул": "LGT-201-D"
    },
    {
        "ID": 301,
        "Название детали": "Лямбда-зонд 4-пиновый",
        "Совместимость моделей": "XDrive G6, Cruiser B7, Vento L3",
        "Оригинал": "Да",
        "Цена (₽)": 2800,
        "Артикул": "LMB-301-O"
    },
    {
        "ID": 302,
        "Название детали": "Лямбда-зонд универсальный",
        "Совместимость моделей": "Подходит ко многим моделям, нужна сверка",
        "Оригинал": "Нет",
        "Цена (₽)": 1900,
        "Артикул": "LMB-301-U"
    },
    {
        "ID": 401,
        "Название детали": "Воздушный фильтр двигателя",
        "Совместимость моделей": "Vento L3 (2007–2012)",
        "Оригинал": "Да",
        "Цена (₽)": 800,
        "Артикул": "FLT-401-O"
    },
    {
        "ID": 402,
        "Название детали": "Воздушный фильтр (аналог)",
        "Совместимость моделей": "Vento L3",
        "Оригинал": "Нет",
        "Цена (₽)": 500,
        "Артикул": "FLT-401-A"
    }
]

current_file_path = os.path.abspath(__file__)
project_root = os.path.dirname(os.path.dirname(current_file_path))
filename = log_dir = os.path.join(project_root, "data/catalog.csv")

with open(filename, mode="w", encoding="utf-8-sig", newline="") as file:
    fieldnames = ["ID", "Название детали", "Совместимость моделей", "Оригинал", "Цена (₽)", "Артикул"]
    writer = csv.DictWriter(file, fieldnames=fieldnames)

    writer.writeheader()

    for row in data:
        writer.writerow(row)

print(f"Файл '{filename}' успешно создан.")